micropython/micropython/ports/esp32/boards/M5STACK_NANOC6/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME    "M5Stack NanoC6"
#define MICROPY_HW_MCU_NAME      "ESP32-C6"

#define MICROPY_HW_I2C0_SCL      (1)
#define MICROPY_HW_I2C0_SDA      (2)
